export type WeatherCondition =
    | "स्पष्ट आकाश"
    | "मुख्यतया स्पष्ट"
    | "आंशिक बादल"
    | "धेरै बादल"
    | "कुहिरो"
    | "बरफिलो कुहिरो"
    | "हल्का पानी"
    | "मध्यम पानी"
    | "धेरै पानी"
    | "हल्का जमेको पानी"
    | "धेरै जमेको पानी"
    | "थोरै पानी"
    | "थोरै हिउँ"
    | "मध्यम हिउँ"
    | "धेरै हिउँ"
    | "हिउँको दाना"
    | "थोरै वर्षा"
    | "मध्यम वर्षा"
    | "भारी वर्षा"
    | "थोरै हिउँ वर्षा"
    | "धेरै हिउँ वर्षा"
    | "बिजुली चम्किरहेको छ"
    | "थोरै हिमकणसहित बिजुली चम्किरहेको छ"
    | "धेरै हिमकणसहित बिजुली चम्किरहेको छ";


export const weatherCodeMap: Record<number, WeatherCondition> = {
    0: "स्पष्ट आकाश",
    1: "मुख्यतया स्पष्ट",
    2: "आंशिक बादल",
    3: "धेरै बादल",
    45: "कुहिरो",
    48: "बरफिलो कुहिरो",
    51: "हल्का पानी",
    53: "मध्यम पानी",
    55: "धेरै पानी",
    56: "हल्का जमेको पानी",
    57: "धेरै जमेको पानी",
    61: "थोरै पानी",
    63: "मध्यम पानी",
    65: "धेरै पानी",
    66: "हल्का जमेको पानी",
    67: "धेरै जमेको पानी",
    71: "थोरै हिउँ",
    73: "मध्यम हिउँ",
    75: "धेरै हिउँ",
    77: "हिउँको दाना",
    80: "थोरै वर्षा",
    81: "मध्यम वर्षा",
    82: "भारी वर्षा",
    85: "थोरै हिउँ वर्षा",
    86: "धेरै हिउँ वर्षा",
    95: "बिजुली चम्किरहेको छ",
    96: "थोरै हिमकणसहित बिजुली चम्किरहेको छ",
    99: "धेरै हिमकणसहित बिजुली चम्किरहेको छ",
};

